"Western (Mac OS Roman)" = "欧米（Mac OS Roman）";
"Japanese (Mac OS)" = "日本語（Mac OS）";
"Traditional Chinese (Mac OS)" = "繁体字中国語（Mac OS）";
"Korean (Mac OS)" = "韓国語（Mac OS）";
"Arabic (Mac OS)" = "アラビア語（Mac OS）";
"Hebrew (Mac OS)" = "ヘブライ語（Mac OS）";
"Greek (Mac OS)" = "ギリシャ語（Mac OS）";
"Cyrillic (Mac OS)" = "キリル文字（Mac OS）";
"Devanagari (Mac OS)" = "デーバナーガリー文字（Mac OS）";
"Gurmukhi (Mac OS)" = "グルムキー文字（Mac OS）";
"Gujarati (Mac OS)" = "グジャラート語（Mac OS）";
"Thai (Mac OS)" = "タイ語（Mac OS）";
"Simplified Chinese (Mac OS)" = "簡体字中国語（Mac OS）";
"Tibetan (Mac OS)" = "チベット語（Mac OS）";
"Central European (Mac OS)" = "中欧（Mac OS）";
"Symbol (Mac OS)" = "記号文字（Mac OS）";
"Dingbats (Mac OS)" = "Dingbats（Mac OS）";
"Turkish (Mac OS)" = "トルコ語（Mac OS）";
"Croatian (Mac OS)" = "クロアチア語（Mac OS）";
"Icelandic (Mac OS)" = "アイスランド語（Mac OS）";
"Romanian (Mac OS)" = "ルーマニア語（Mac OS）";
"Celtic (Mac OS)" = "ケルト語（Mac OS）";
"Gaelic (Mac OS)" = "ゲール語（Mac OS）";
"Keyboard Symbols (Mac OS)" = "キーボード記号（Mac OS）";
"Farsi (Mac OS)" = "現代ペルシャ語（Mac OS）";
"Cyrillic (Mac OS Ukrainian)" = "キリル文字（Mac OS ウクライナ語）";
"Inuit (Mac OS)" = "イヌイット語（Mac OS）";
"Unicode (UTF-16)" = "Unicode（UTF-16）";
"Unicode (UTF-7)" = "Unicode（UTF-7）";
"Unicode (UTF-8)" = "Unicode（UTF-8）";
"Unicode (UTF-32)" = "Unicode（UTF-32）";
"Unicode (UTF-16BE)" = "Unicode（UTF-16BE）";
"Unicode (UTF-16LE)" = "Unicode（UTF-16LE）";
"Unicode (UTF-32BE)" = "Unicode（UTF-32BE）";
"Unicode (UTF-32LE)" = "Unicode（UTF-32LE）";
"Western (ISO Latin 1)" = "欧米（ISO Latin 1）";
"Central European (ISO Latin 2)" = "中欧（ISO Latin 2）";
"Western (ISO Latin 3)" = "欧米（ISO Latin 3）";
"Central European (ISO Latin 4)" = "中欧（ISO Latin 4）";
"Cyrillic (ISO 8859-5)" = "キリル文字（ISO 8859-5）";
"Arabic (ISO 8859-6)" = "アラビア語（ISO 8859-6）";
"Greek (ISO 8859-7)" = "ギリシャ語（ISO 8859-7）";
"Hebrew (ISO 8859-8)" = "ヘブライ語（ISO 8859-8）";
"Turkish (ISO Latin 5)" = "トルコ語（ISO Latin 5）";
"Nordic (ISO Latin 6)" = "北欧（ISO Latin 6）";
"Thai (ISO 8859-11)" = "タイ語（ISO 8859-11）";
"Baltic (ISO Latin 7)" = "バルト諸語（ISO Latin 7）";
"Celtic (ISO Latin 8)" = "ケルト語（ISO Latin 8）";
"Western (ISO Latin 9)" = "欧米（ISO Latin 9）";
"Romanian (ISO Latin 10)" = "ルーマニア語（ISO Latin 10）";
"Latin-US (DOS)" = "Latin-US（DOS）";
"Greek (DOS)" = "ギリシャ語（DOS）";
"Baltic (DOS)" = "バルト諸語（DOS）";
"Western (DOS Latin 1)" = "欧米（DOS Latin 1）";
"Greek (DOS Greek 1)" = "ギリシャ語（DOS Greek 1）";
"Central European (DOS Latin 2)" = "中欧（DOS Latin 2）";
"Cyrillic (DOS)" = "キリル文字（DOS）";
"Turkish (DOS)" = "トルコ語（DOS）";
"Portuguese (DOS)" = "ポルトガル語（DOS）";
"Icelandic (DOS)" = "アイスランド語（DOS）";
"Hebrew (DOS)" = "ヘブライ語（DOS）";
"Canadian French (DOS)" = "カナダ・フランス語（DOS）";
"Arabic (DOS)" = "アラビア語（DOS）";
"Nordic (DOS)" = "北欧諸語（DOS）";
"Russian (DOS)" = "ロシア語（DOS）";
"Greek (DOS Greek 2)" = "ギリシャ語（DOS Greek 2）";
"Thai (Windows, DOS)" = "タイ語（Windows, DOS）";
"Japanese (Windows, DOS)" = "日本語（Windows, DOS）";
"Simplified Chinese (Windows, DOS)" = "簡体字中国語（Windows, DOS）";
"Korean (Windows, DOS)" = "韓国語（Windows, DOS）";
"Traditional Chinese (Windows, DOS)" = "繁体字中国語（Windows, DOS）";
"Western (Windows Latin 1)" = "欧米（Windows Latin 1）";
"Central European (Windows Latin 2)" = "中欧（Windows Latin 2）";
"Cyrillic (Windows)" = "キリル文字（Windows）";
"Greek (Windows)" = "ギリシャ語（Windows）";
"Turkish (Windows Latin 5)" = "トルコ語（Windows Latin 5）";
"Hebrew (Windows)" = "ヘブライ語（Windows）";
"Arabic (Windows)" = "アラビア語（Windows）";
"Baltic (Windows)" = "バルト諸語（Windows）";
"Vietnamese (Windows)" = "ベトナム語（Windows）";
"Western (ASCII)" = "欧米（ASCII）";
"Japanese (Shift JIS X0213)" = "日本語（Shift JIS X0213）";
"Chinese (GBK)" = "中国語（GBK）";
"Chinese (GB 18030)" = "中国語（GB 18030）";
"Japanese (ISO 2022-JP)" = "日本語（ISO 2022-JP）";
"Japanese (ISO 2022-JP-2)" = "日本語（ISO 2022-JP-2）";
"Japanese (ISO 2022-JP-1)" = "日本語（ISO 2022-JP-1）";
"Chinese (ISO 2022-CN)" = "中国語（ISO 2022-CN）";
"Korean (ISO 2022-KR)" = "韓国語（ISO 2022-KR）";
"Japanese (EUC)" = "日本語（EUC）";
"Simplified Chinese (GB 2312)" = "簡体字中国語（GB 2312）";
"Traditional Chinese (EUC)" = "繁体字中国語（EUC）";
"Korean (EUC)" = "韓国語（EUC）";
"Japanese (Shift JIS)" = "日本語（Shift JIS）";
"Cyrillic (KOI8-R)" = "キリル文字（KOI8-R）";
"Traditional Chinese (Big 5)" = "繁体字中国語（Big 5）";
"Western (Mac Mail)" = "欧米（Mac Mail）";
"Simplified Chinese (HZ GB 2312)" = "簡体字中国語（HZ GB 2312）";
"Traditional Chinese (Big 5 HKSCS)" = "繁体字中国語（Big 5 HKSCS）";
"Ukrainian (KOI8-U)" = "ウクライナ語（KOI8-U）";
"Traditional Chinese (Big 5-E)" = "繁体字中国語（Big 5-E）";
"Western (NextStep)" = "欧米（NextStep）";
"Non-lossy ASCII" = "Non-lossy ASCII";
"Western (EBCDIC Latin Core)" = "欧米（EBCDIC Latin Core）";
"Western (EBCDIC Latin 1)" = "欧米（EBCDIC Latin 1）";
"Japanese (Auto Detect)" = "日本語（自動判定）";
